[{"model": "store.product", "pk": 1, "fields": {"product_name": "iPhone 14 Pro", "product_brand": "Apple", "product_price": 300, "product_description": "Super Retina XDR display\r\n6.1‑inch (diagonal) all‑screen OLED display\r\n2556‑by‑1179-pixel resolution at 460 ppi\r\nThe iPhone 14 Pro display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the screen is 6.12 inches diagonally (actual viewable area is less).", "product_specs": "Pro camera system\r\n48MP Main: 24 mm, ƒ/1.78 aperture, second-generation sensor-shift optical image stabilization, seven‑element lens, 100% Focus Pixels\r\n12MP Ultra Wide: 13 mm, ƒ/2.2 aperture and 120° field of view, six‑element lens, 100% Focus Pixels\r\n12MP 2x Telephoto (enabled by quad-pixel sensor): 48 mm, ƒ/1.78 aperture, second-generation sensor-shift optical image stabilization, seven‑element lens, 100% Focus Pixels\r\n12MP 3x Telephoto: 77 mm, ƒ/2.8 aperture, optical image stabilization, six-element lens\r\n3x optical zoom in, 2x optical zoom out; 6x optical zoom range; digital zoom up to 15x\r\nSapphire crystal lens cover\r\nAdaptive True Tone flash\r\nPhotonic Engine\r\nDeep Fusion\r\nSmart HDR 4\r\nPortrait mode with advanced bokeh and Depth Control\r\nPortrait Lighting with six effects (Natural, Studio, Contour, Stage, Stage Mono, High‑Key Mono)\r\nNight mode\r\nNight mode portraits enabled by LiDAR Scanner\r\nPanorama (up to 63MP)\r\nPhotographic Styles\r\nMacro photography\r\nApple ProRAW\r\nWide color capture for photos and Live Photos\r\nLens correction (Ultra Wide)\r\nAdvanced red‑eye correction\r\nAuto image stabilization\r\nBurst mode\r\nPhoto geotagging\r\nImage formats captured: HEIF, JPEG, and DNG\r\nVideo Recording\r\n4K video recording at 24 fps, 25 fps, 30 fps, or 60 fps\r\n1080p HD video recording at 25 fps, 30 fps, or 60 fps\r\n720p HD video recording at 30 fps\r\nCinematic mode up to 4K HDR at 30 fps\r\nAction mode up to 2.8K at 60 fps\r\nHDR video recording with Dolby Vision up to 4K at 60 fps\r\nProRes video recording up to 4K at 30 fps (1080p at 30 fps for 128GB storage)\r\nMacro video recording, including slo-mo and time-lapse\r\nSlo‑mo video support for 1080p at 120 fps or 240 fps\r\nTime‑lapse video with stabilization\r\nNight mode Time-lapse\r\nQuickTake video\r\nSecond‑generation sensor‑shift optical image stabilization for video (Main)\r\nDual optical image stabilization for video (Main and Telephoto)\r\n3x optical zoom in, 2x optical zoom out; 6x optical zoom range\r\nDigital zoom up to 9x\r\nAudio zoom\r\nTrue Tone flash\r\nCinematic video stabilization (4K, 1080p, and 720p)\r\nContinuous autofocus video\r\nTake 8MP still photos while recording 4K video\r\nPlayback zoom\r\nVideo formats recorded: HEVC, H.264, and ProRes\r\nStereo recording\r\nTrueDepth Camera\r\n12MP camera\r\nƒ/1.9 aperture\r\nAutofocus with Focus Pixels\r\nSix‑element lens\r\nRetina Flash\r\nPhotonic Engine\r\nDeep Fusion\r\nSmart HDR 4\r\nPortrait mode with advanced bokeh and Depth Control\r\nPortrait Lighting with six effects (Natural, Studio, Contour, Stage, Stage Mono, High‑Key Mono)\r\nAnimoji and Memoji\r\nNight mode\r\nPhotographic Styles\r\nApple ProRAW\r\nWide color capture for photos and Live Photos\r\nLens correction\r\nAuto image stabilization\r\nBurst mode\r\n4K video recording at 24 fps, 25 fps, 30 fps, or 60 fps\r\n1080p HD video recording at 25 fps, 30 fps, or 60 fps\r\nCinematic mode up to 4K HDR at 30 fps\r\nHDR video recording with Dolby Vision up to 4K at 60 fps\r\nProRes video recording up to 4K at 30 fps (1080p at 30 fps for 128GB storage)\r\nSlo‑mo video support for 1080p at 120 fps\r\nTime‑lapse video with stabilization\r\nNight mode Time-lapse\r\nQuickTake video\r\nCinematic video stabilization (4K, 1080p, and 720p)\r\nFace ID\r\nEnabled by TrueDepth camera for facial recognition\r\nApple Pay\r\nPay with your iPhone using Face ID in stores, within apps, and on the web\r\nSend and receive money in Messages with Apple Cash4\r\nComplete purchases made with Apple Pay on your Mac\r\nPay for your ride using Express Transit5\r\nLearn more about Apple Pay\r\n\r\nLearn more about Apple Cash\r\n\r\nApple Card\r\nCredit card created by Apple, designed for iPhone\r\nGet 3% Daily Cash at Apple. And at select merchants when you use Apple Pay.\r\nUse the Wallet app to apply for, manage, and use Apple Card\r\nTitanium, laser‑etched physical credit card for use where Apple Pay is not accepted yet\r\nShare with up to five people, 13 years or older, in your Family Sharing group to track expenses, manage spending, and build credit together (for those over 18)6\r\nLearn more about Apple Card\r\n\r\nSafety\r\nEmergency SOS via satellite7\r\nCrash Detection\r\nCarriers\r\n\r\n \r\n\r\n \r\n\r\n \r\n\r\nCellular and Wireless\r\nModel A2650*\r\n\r\n5G NR (Bands n1, n2, n3, n5, n7, n8, n12, n14, n20, n25, n26, n28, n29, n30, n38, n40, n41, n48, n53, n66, n70, n71, n77, n78 n79)\r\n5G NR mmWave (Bands n258, n260, n261)\r\nFDD-LTE (Bands 1, 2, 3, 4, 5, 7, 8, 12, 13, 14, 17, 18, 19, 20, 25, 26, 28, 29, 30, 32, 66, 71)\r\nTD-LTE (Bands 34, 38, 39, 40, 41, 42, 46, 48, 53)\r\nUMTS/HSPA+/DC-HSDPA (850, 900, 1700/2100, 1900, 2100 MHz)\r\nGSM/EDGE (850, 900, 1800, 1900 MHz)\r\nModel A2651*\r\n\r\n5G NR (Bands n1, n2, n3, n5, n7, n8, n12, n14, n20, n25, n26, n28, n29, n30, n38, n40, n41, n48, n53, n66, n70, n71, n77, n78 n79)\r\n5G NR mmWave (Bands n258, n260, n261)\r\nFDD-LTE (Bands 1, 2, 3, 4, 5, 7, 8, 12, 13, 14, 17, 18, 19, 20, 25, 26, 28, 29, 30, 32, 66, 71)\r\nTD-LTE (Bands 34, 38, 39, 40, 41, 42, 46, 48, 53)\r\nUMTS/HSPA+/DC-HSDPA (850, 900, 1700/2100, 1900, 2100 MHz)\r\nGSM/EDGE (850, 900, 1800, 1900 MHz)\r\nAll models\r\n\r\n5G (sub‑6 GHz and mmWave) with 4x4 MIMO8\r\nGigabit LTE with 4x4 MIMO and LAA8\r\nWi‑Fi 6 (802.11ax) with 2x2 MIMO\r\nBluetooth 5.3\r\nUltra Wideband chip for spatial awareness9\r\nNFC with reader mode\r\nExpress Cards with power reserve\r\nLocation\r\nPrecision dual-frequency GPS (GPS, GLONASS, Galileo, QZSS, and BeiDou)\r\nDigital compass\r\nWi-Fi\r\nCellular\r\niBeacon microlocation\r\nVideo Calling10\r\nFaceTime video calling over cellular or Wi‑Fi\r\nFaceTime HD (1080p) video calling over 5G or Wi‑Fi\r\nShare experiences like movies, TV, music, and other apps in a FaceTime call with SharePlay\r\nScreen sharing\r\nPortrait mode in FaceTime video\r\nSpatial Audio\r\nVoice Isolation and Wide Spectrum microphone modes\r\nOptical zoom with rear‑facing camera", "product_image": "photos/products/1.png", "stock": 10, "is_available": true, "category": 1, "created_date": "2022-12-21T13:46:23.299Z", "modified_date": "2023-01-02T18:39:54.148Z"}}, {"model": "store.product", "pk": 2, "fields": {"product_name": "OnePlus 10 Pro", "product_brand": "OnePlus", "product_price": 200, "product_description": "Released 2022, January 13\r\n201g, 8.6mm thickness\r\nAndroid 12, up to 13, OxygenOS 13, ColorOS\r\n128GB/256GB/512GB storage, no card slot\r\n3,661,759 HITS\r\n6.7\"\r\n1440x3216 pixels\r\n50MP\r\n4320p", "product_specs": "NETWORK\tTechnology\t\r\nGSM / CDMA / HSPA / EVDO / LTE / 5G\r\nLAUNCH\tAnnounced\t2022, January 11\r\nStatus\tAvailable. Released 2022, January 13\r\nBODY\tDimensions\t163 x 73.9 x 8.6 mm (6.42 x 2.91 x 0.34 in)\r\nWeight\t201 g (7.09 oz)\r\nBuild\tGlass front (Gorilla Glass Victus), glass back (Gorilla Glass 5), aluminum frame\r\nSIM\tSingle SIM (Nano-SIM) or Dual SIM (Nano-SIM, dual stand-by)\r\n \tIP68 dust/water resistant - T-Mobile only (not for use underwater, liquid damage is not covered under warranty)\r\nDISPLAY\tType\tLTPO2 Fluid AMOLED, 1B colors, 120Hz, HDR10+, 500 nits (typ), 800 nits (HBM), 1300 nits (peak)\r\nSize\t6.7 inches, 108.4 cm2 (~90.0% screen-to-body ratio)\r\nResolution\t1440 x 3216 pixels, 20:9 ratio (~525 ppi density)\r\nProtection\tCorning Gorilla Glass Victus\r\n \tAlways-on display\r\nPLATFORM\tOS\tAndroid 12, upgradable to Android 13, OxygenOS 13 (International), ColorOS (China)\r\nChipset\tQualcomm SM8450 Snapdragon 8 Gen 1 (4 nm)\r\nCPU\tOcta-core (1x3.00 GHz Cortex-X2 & 3x2.50 GHz Cortex-A710 & 4x1.80 GHz Cortex-A510)\r\nGPU\tAdreno 730\r\nMEMORY\tCard slot\tNo\r\nInternal\t128GB 8GB RAM, 256GB 8GB RAM, 256GB 12GB RAM, 512GB 12GB RAM\r\n \tUFS 3.1\r\nMAIN CAMERA\tTriple\t48 MP, f/1.8, 23mm (wide), 1/1.43\", 1.12µm, multi-directional PDAF, Laser AF, OIS\r\n8 MP, f/2.4, 77mm (telephoto), 1.0µm, PDAF, OIS, 3.3x optical zoom\r\n50 MP, f/2.2, 14mm, 150˚ (ultrawide), 1/2.76\", 0.64µm\r\nFeatures\tHasselblad Color Calibration, Dual-LED dual-tone flash, HDR, panorama\r\nVideo\t8K@24fps, 4K@30/60/120fps, 1080p@30/60/240fps, Auto HDR, gyro-EIS\r\nSELFIE CAMERA\tSingle\t32 MP, f/2.2, (wide), 1/2.74\", 0.8µm\r\nFeatures\tAuto-HDR\r\nVideo\t1080p@30fps, gyro-EIS\r\nSOUND\tLoudspeaker\tYes, with stereo speakers\r\n3.5mm jack\tNo\r\n \t24-bit/192kHz audio\r\nCOMMS\tWLAN\tWi-Fi 802.11 a/b/g/n/ac/6, dual-band, Wi-Fi Direct\r\nBluetooth\t5.2, A2DP, LE, aptX HD\r\nPositioning\tGPS (L1+L5), GLONASS (G1), BDS (B1), GALILEO (E1+E5a)\r\nNFC\tYes\r\nRadio\tNo\r\nUSB\tUSB Type-C 3.1, OTG\r\nFEATURES\tSensors\tFingerprint (under display, optical), accelerometer, gyro, proximity, compass, color spectrum, barometer\r\nBATTERY\tType\tLi-Po 5000 mAh, non-removable\r\nCharging\t80W wired, PD, 1-100% in 32 min (International)\r\n65W wired, PD, 1-58% in 15 min (North America)\r\n50W wireless\r\nReverse wireless\r\nMISC\tColors\tVolcanic Black, Emerald Forest, Panda White (Extreme Edition)\r\nModels\tNE2210, NE2211, NE2213, NE2215, NE2217\r\nPrice\t$ 509.00 / € 759.00 / £ 639.24 / ₹ 48,999 / C$ 869.99\r\nTESTS\tPerformance\tAnTuTu: 886248 (v9)\r\nGeekBench: 3447 (v5.1)\r\nGFXBench: 48fps (ES 3.1 onscreen)\r\nDisplay\tContrast ratio: Infinite (nominal)\r\nCamera\tPhoto / Video\r\nLoudspeaker\t-25.2 LUFS (Very good)\r\nBattery life\t\r\nEndurance rating 107h", "product_image": "photos/products/EU-IN_Black.png", "stock": 10, "is_available": true, "category": 1, "created_date": "2022-12-21T13:51:15.152Z", "modified_date": "2023-01-02T18:40:12.505Z"}}, {"model": "store.product", "pk": 3, "fields": {"product_name": "Samsung Galaxy Watch4", "product_brand": "Samsung", "product_price": 100, "product_description": "Better insights to reach your fitness goals get more out of every mile thanks to built-in pace coaching on the Galaxy Watch ; Its advanced sensors keep your pace to help you better achieve your run goals\r\nOne charger, two devices. Simultaneously power up your favorite pair of devices to enjoy together — whether that's your phone and Galaxy Watch or your Galaxy Watch and earbuds. At night, simply place to charge and you'll be set for the next day.\r\nWorks well with others. The Wireless Charger Duo is compatible with a wide range of devices. Easily charge a variety of your favorites from your phone to your watch.\r\nGalaxy Watches are right at home. Charge your Galaxy Watch in a snap with its dedicated placement. This spot features an interior magnet on the right side, ensuring the watch fits snugly into place as you set it down.\r\nNote: Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.", "product_specs": "BODY COMPOSITION ANALYSIS: Galaxy Watch4 is the first smartwatch to off body composition data right on your wrist, On your own schedule, now you can get readings on body fat, skeletal muscle, body water, basal metabolic rate, and Body Mass Index\r\nBETTER SLEEP STARTS HERE: Wake up feeling refreshed and recharged with advanced sleep tracking; When you go to bed, your Galaxy Watch4 sleep tracker starts monitoring your sleep and SpO2 levels continuously\r\nBE SMART ABOUT YOUR HEART: Take care of your heart with accurate ECG monitoring and keep an eye on possible atrial fibrillation, a common form of irregular heart rhythm; Share personalized readings with your doctor using the Samsung Health Monitor app on your compatible Galaxy phone\r\nMAKE EVERY WORKOUT COUNT: Get the most out of every exercise session with advanced workout tracking that recognizes 6 popular activities, from running to rowing to swimming, automatically in just 3 minutes; Stay motivated by connecting to live coaching sessions via your smartphone or to dynamic Group Challenges with your friends\r\nGO THE EXTRA MILE: Improve your runs with advanced running coaching technology; VO2 Max readings assess your oxygen levels to manage and track your heart and lung endurance\r\nEXTENSION OF YOUR PHONE: Put the phone features you need right on your wrist and stay connected to calls, texts, notifications, and music streaming, all accessible with a simple tap\r\nGOOGLE ON YOUR WRIST: Tap into the power and convenience of select Google services and apps right from your wrist; Pay for coffee; Get directions to the park; Use Bixby or Google Assistant for help on almost any topic; Stream your favorite tunes on YouTube\r\n\r\n1 of SAMSUNG 9W Wireless Charger Duo w/ USB C Cable, Charge 2 Devices at Once, Cordless Super Fast Charging Pad for Galaxy Phones and Devices, 2021, US Version, Black\r\n (4,760)\r\nONE CHARGER, TWO DEVICES: Simultaneously power up your favorite pair of devices to enjoy together — whether that's your phone and Galaxy Watch or your Galaxy Watch and earbuds; At night, simply place to charge and you'll be set for the next day*.Compatible devices:Smart Phones; headphones, Laptops.Special Feature:Wireless;Universal\r\nWORKS WELL WITH OTHERS: The Wireless Charger Duo is compatible with a wide range of devices; Easily charge a variety of your favorites from your phone to your watch**\r\nGALAXY WATCHES ARE RIGHT AT HOME: Charge your Galaxy Watch in a snap with its dedicated placement; This spot features an interior magnet on the right side, ensuring the watch fits snugly into place as you set it down***\r\nDIM FOR A GOOD NIGHTS SLEEP: No need to let the light disturb your beauty rest. The Friendly LED not only intuitively changes color to show your devices’ charging status, it can also be set to dim so it doesn’t interrupt your sleep****\r\nLEAVE YOUR PHONE IN THE CASE: Your phone charges even while protected; The charge can reach through lightweight cases, so there's no need to fumble with taking off the case — simply place and charge*****\r\nPOWER TO POWER UP: Get the charge you need quickly, thanks to up to 9W of Fast Charging Support; This boost of battery is compatible with USB PD and Adaptive Fast Charging travel adapters for an easy pick-me up******", "product_image": "photos/products/10.jpg", "stock": 10, "is_available": true, "category": 3, "created_date": "2022-12-21T13:53:55.938Z", "modified_date": "2023-01-02T18:40:26.218Z"}}, {"model": "store.product", "pk": 4, "fields": {"product_name": "Samsung Galaxy S22 Ultra", "product_brand": "Samsung", "product_price": 1000, "product_description": "For Gen Z, video isn’t just video. They think of it as a lifestyle – a universal language for how they learn, grow, express, talk, shop, connect, create, and fight boredom with their friends in real time. That’s why they’re demanding a mobile device that finally breaks all the rules of video and makes their everyday more epic than ever. Introducing Samsung Galaxy S22 Ultra, the brilliant new smartphones designed specifically to break the rules of video to meet the needs of Gen Z’s native language; video. With this new video machine, we’re setting an epic new standard. Now, you can communicate with your friends online while you simultaneously co-watch the latest new YouTube videos.**** Record your greatest nights with breathtaking low-light video like never before. Capture the true colors and contrasts of late-night parties that couldn’t be properly depicted before. And you can finally devour vids in direct sunlight with a screen that’s so bright, you’ll never have to worry about glare on the beach again. Galaxy S22 Ultra is redefining the epic standard – both for what a smartphone can do with video and for what you can communicate, create, and experience with it. In other words, if you’ve got something to say, Galaxy S22 Ultra makes it possible to say anything you want with video, at any time-even in the darkness of night. *Supports Full HD video with up to 60 fps. **Based on average battery life under typical usage conditions. Average expected performance based on typical use. Actual battery life depends on factors such as network, features selected, frequency of calls, and voice, data, and other application usage patterns. ***Wall charger sold separately; use only Samsung-approved chargers and cables. To avoid injury or damage to your device, do not use incompatible, worn or damaged batteries, chargers or cables. Supports 45W charging. ****Requires all participants have Galaxy S22 devices with Android 12 OS.", "product_specs": "8K SUPER STEADY VIDEO: Shoot videos that rival how epic your life is with stunning 8K recording, the highest recording resolution available on a smartphone; Video captured is effortlessly smooth, thanks to Auto Focus Video Stabilization on Galaxy S22 Ultra.Form_factor : Smartphone\r\nNIGHTOGRAPHY plus PORTAIT MODE: Capture the night with crystal clear, bright pics and videos, no matter the lighting with Night Mode; Portrait Mode auto-detects and adjusts to what you want front and center, making all your photos worthy of a frame\r\n108MP PHOTO RESOLUTION plus BRIGHT DISPLAY: Capture premium detail with 108MP resolution— the highest available on a cell phone; Your favorite content will look even more epic on our brightest display ever with Vision Booster\r\nADAPTIVE COLOR CONTRAST: Streaming on the go, working from your patio or binge-watching late into the night. The Galaxy S22 Ultra adaptive screen automatically optimizes color and brightness, outdoors and indoors\r\nLONG LASTING BATTERY plus FAST CHARGING: Power every scroll, click, tap and stream all day long and then some with an intelligent, long-lasting battery; Dive back into action at a moment’s notice with 45W Super-Fast Charging\r\nEMBEDDED S PEN: New phone, new S Pen; Now you can unleash your creativity on Galaxy S22 Ultra with an embedded S Pen; Edit photos and videos with pinpoint accuracy, and do it all with that pen-to-paper feel\r\nPREMIUM DESIGN & CRAFTMANSHIP: With a classy, eye-catching glass-metal-glass design, we’re setting a standard for smart phones; With our strongest aluminum frame and the latest Gorilla Glass, this phone is lightweight and durable to help endure scratches and dings\r\nNote: Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.", "product_image": "photos/products/9.jpg", "stock": 26, "is_available": true, "category": 1, "created_date": "2022-12-21T14:01:29.188Z", "modified_date": "2023-01-02T18:40:35.238Z"}}, {"model": "store.product", "pk": 5, "fields": {"product_name": "Samsung Galaxy Z Fold4", "product_brand": "Samsung", "product_price": 3000, "product_description": "Unfold your world and achieve next level productivity with Samsung Galaxy Z Fold4. This is the phone that holds its own so you can do two things at once. More screen means more doing. Launch multiple apps side by side with multi-window view. Maximize your viewing pleasure by unfolding your mobile phone into a tablet sized screen. It’s strong, sleek, and sturdy. Take on your day with the most reliable folding screen technology. Talk with friends while checking off your to-do list with hands-free video chat. Use S Pen* on your Galaxy Z Fold4 with ease. Write out notes, sketch things out and get more done on the go. See your apps as big as they should be. With app display optimization, numerous apps naturally fit the edge-to-edge screen. Experience the continuity of having your Galaxy Z Fold4 and Galaxy Watch completely in sync. Fold up your Galaxy Z Fold4 and keep listening to what you love with connected Galaxy Buds. Enjoy an uninterrupted screen with an under-display selfie camera. *Compatible with S Pen Fold Edition and S Pen Pro only, sold separately. Works with main display only. **Drag and drop functionality works with select applications.", "product_specs": "FLEX MODE: Free up your hands with Flex Mode on the Galaxy Z Fold4; This smartphone stands on its own so you can take notes during a conference call or follow along with instructional videos in real time.Form_factor : Fold\r\nHANDS FREE VIDEO: Don’t stay stuck to your cellphone; Set up your phone in Flex Mode and check off your to-dos while catching up with friends; Hands-free video chat lets you multitask and move freely while staying in frame\r\nMULTI-VIEW WINDOW: Easily attend a virtual work meeting and capture important notes at the same time, or catch up on your favorite shows as you answer texts; With multiple windows, doing different tasks is easy with Galaxy Z Fold4\r\nS PEN READY: Transform your Galaxy Z Fold4 into a multifunctional device with S Pen; It gives you that pen-on-paper feeling and makes it easy to take notes while attending virtual meetings, drag and drop content, and get more done\r\nYOUR APPS, YOUR WAY: App display optimization allows you to customize how you see apps on the edge-to-edge screen of Galaxy Z Fold4; Also, use multiple apps to their full potential by dragging and dropping content from one window to the other\r\nYOUR PHONE & WATCH WORK AS ONE: Unfold the possibilities of your Galaxy Z Fold4 connected to your Galaxy Watch; Use your Watch to snap hands-free selfies with Flex Mode; Plus, keep track of your day by easily switching between your Galaxy Watch and phone\r\nBIG SCREEN, BIG SOUND: Need to head out while you’re in the middle of your favorite podcast, Slide Galaxy Z Fold4 into your pocket and keep listening with your Galaxy Buds; Unfold connectivity with your smart phone and Buds working together\r\nNote: Products with electrical plugs are designed for use in the US. Outlets and voltage differ internationally and this product may require an adapter or converter for use in your destination. Please check compatibility before purchasing.", "product_image": "photos/products/11.jpg", "stock": 31, "is_available": true, "category": 1, "created_date": "2022-12-21T14:03:31.300Z", "modified_date": "2023-01-02T18:40:44.024Z"}}, {"model": "store.product", "pk": 6, "fields": {"product_name": "MSI MEG Aegis Ti5 12th gaming desktop", "product_brand": "MSI", "product_price": 3000, "product_description": "MSI Aegis Ti5 (Full) Gaming Desktop, Intel Core i9-12900K, GeForce RTX 3080 Ti, 64GB Memory, 2TB SSD + 2TB HDD, WiFi 6E, Liquid Cooling, USB Type-C, VR-Ready, Windows 11 PRO (12VTF-027US)", "product_specs": "Standing screen display size\t‎0.01\r\nProcessor\t‎5.2 GHz intel_core_i9\r\nRAM\t‎64 GB DDR5\r\nHard Drive\t‎2 TB SSD, HDD\r\nGraphics Coprocessor\t‎Nvidia Ge Force Rtx 3080 Ti\r\nChipset Brand\t‎NVIDIA\r\nCard Description\t‎Dedicated\r\nGraphics Card Ram Size\t‎12 GB\r\nWireless Type\t‎5 GHz Radio Frequency, 802.11ab, 2.4 GHz Radio Frequency\r\nNumber of USB 2.0 Ports\t‎2\r\nNumber of USB 3.0 Ports\t‎2\r\nOther Technical Details\r\nBrand\t‎MSI\r\nSeries\t‎MEG Aegis Ti5 12VTF-027US\r\nItem model number\t‎AegTi512VTF027\r\nHardware Platform\t‎PC\r\nOperating System\t‎Windows 11 Pro\r\nItem Weight\t‎33.1 pounds\r\nProduct Dimensions\t‎27 x 26.5 x 14.06 inches\r\nItem Dimensions LxWxH\t‎27 x 26.5 x 14.06 inches\r\nColor\t‎Aegis Ti5 (BLK) w/ARGB\r\nProcessor Brand\t‎Intel\r\nComputer Memory Type\t‎DDR5 RAM\r\nFlash Memory Size\t‎4 TB\r\nHard Drive Interface\t‎Solid State\r\nHard Drive Rotational Speed\t‎7200", "product_image": "photos/products/3.jpg", "stock": 17, "is_available": true, "category": 4, "created_date": "2022-12-21T14:06:01.996Z", "modified_date": "2023-01-02T18:40:54.542Z"}}, {"model": "store.product", "pk": 7, "fields": {"product_name": "MSI Titan GT77 gaming", "product_brand": "", "product_price": 3676, "product_description": "MSI Titan GT77 17.3\" UHD 120Hz Gaming Laptop: Intel Core i7-12800HX RTX 3070 Ti 32GB DDR5 1TB NVMe SSD, Thunderbolt 4, USB-Type C, Cooler Boost Titan, Win11 Pro: Core Black 12UGS-009", "product_specs": "Standing screen display size\t‎17.3 Inches\r\nScreen Resolution\t‎3840 x 2160 pixels\r\nMax Screen Resolution\t‎3840x2160 Pixels\r\nProcessor\t‎4.8 GHz core_i7\r\nRAM\t‎32 GB DDR5\r\nHard Drive\t‎1 TB SSD\r\nGraphics Coprocessor\t‎NVIDIA GeForce RTX 3070\r\nChipset Brand\t‎NVIDIA\r\nCard Description\t‎Dedicated\r\nWireless Type\t‎Bluetooth\r\nNumber of USB 3.0 Ports\t‎3\r\nOther Technical Details\r\nBrand\t‎MSI\r\nSeries\t‎TITAN GT77 12UGS-009\r\nItem model number\t‎TITANGT7712009\r\nOperating System\t‎Windows 11 Pro\r\nItem Weight\t‎13.95 pounds\r\nProduct Dimensions\t‎15.63 x 12.99 x 0.91 inches\r\nItem Dimensions LxWxH\t‎15.63 x 12.99 x 0.91 inches\r\nColor\t‎Blue\r\nProcessor Brand\t‎Intel\r\nProcessor Count\t‎1\r\nComputer Memory Type\t‎DDR5 SDRAM\r\nFlash Memory Size\t‎1 TB\r\nHard Drive Interface\t‎USB\r\nBatteries\t‎1 Lithium Ion batteries required. (included)", "product_image": "photos/products/1024.png", "stock": 16, "is_available": true, "category": 2, "created_date": "2022-12-21T14:08:26.363Z", "modified_date": "2022-12-21T17:17:09.618Z"}}, {"model": "store.product", "pk": 8, "fields": {"product_name": "Ruggear RG850", "product_brand": "Ruggear", "product_price": 900, "product_description": "SMART, IMMERSIVE TECHNOLOGY FOR EVERY SITUATION\r\nMeet the RG850, the world’s first rugged 18:9 Android Oreo phone. Practical and slim in profile, it features an “Edge-to-Edge” screen for you to enjoy the ultimate immersive experience. The RG850 is elegant and resistant against falls, dust and water, so you can face the day wherever you are.", "product_specs": "A display without limits\r\nImmerse yourself in a bigger view with our “Edge-to-Edge” screen for expanded, uninterrupted imagery. The 5.99 inch LCD display with 18:9 aspect ratio creates a seamless experience on-the-go.\r\n\r\nDrop IP68\r\nRugged to the core\r\nIt is IP68 certified to resist water, dust and shocks and can be dropped from 1.5 m high. No matter the conditions, we guarantee robust and innovative technology you can rely on.\r\n\r\nAndroid\r\nSmarter and faster Android Oreo\r\nEquipped with the Android 8.1 Oreo OS, the RG850 is a true world’s first. Explore the world with the smartest, fastest and most powerful operating system.\r\n\r\nMIL810\r\nMIL-STD-810G tested\r\nIndustry-leading and military-rated rugged performance of RG850, proven by MIL-STD-810G standards, guarantees the great strength to withstand a variety of shocks, bumps, temperatures, and pressures.\r\n\r\nGorilla glass\r\nScratch-resistant Gorilla Glass Screen\r\nThe Gorilla Glass display is the perfect balance of toughness and optical sharpness. The screen gives you the extra security you need when handling it.\r\n\r\nGood design\r\nModern, elegant design\r\nA tough grip to avoid drops, a carbon fibre-like rear silhouette and curved corners, means you get all the benefits of going rugged without necessitating another smartphone for other occasions. Add to this a thickness of just 12 mm, unparalleled in the rugged phone market.\r\n\r\nBattery\r\nLong battery life\r\nWith an outstanding battery life – 4000 mAh – the RG850 can go anywhere on your journey and won’t leave you high and dry.", "product_image": "photos/products/8.jpg", "stock": 23, "is_available": true, "category": 1, "created_date": "2022-12-21T14:10:17.297Z", "modified_date": "2023-01-02T18:41:09.532Z"}}, {"model": "store.product", "pk": 9, "fields": {"product_name": "Ruggear RG655", "product_brand": "Ruggear", "product_price": 1000, "product_description": "RG655\r\nSLEEK AND SLENDER YET RUGGED TO THE CORE\r\nEngineered with German precision, RG655 can withstand a variety of extremes including relentless pounding, pressure and elements. Faturing a fast CPU (Helio P22), 13 + 8MP cameras, VoLTE, powerful speaker (95 dB) and Android 11 OS.", "product_specs": "Enhanced Camera Performance\r\nRG655’s 13+8 MP cameras offer you improved performance.\r\n\r\nCustomized key\r\nUser defined button\r\nDefine the yellow side button to do anything you want – open the camera, torch, vibrate/silence, PTT (Push-to-talk), or any app are just one press away!\r\n\r\nSpeaker\r\nCrystal clear audio\r\nEquipped with a powerful speaker (95 dB), RG655 is ideal for noisy worksites indoors and outdoors.\r\n\r\nBattery\r\nLong lasting battery\r\nRG655’s strong 4200 mAh battery provides a constant all-day flow of power. No longer worry about searching for a charger at critical moments.", "product_image": "photos/products/7.jpg", "stock": 25, "is_available": true, "category": 1, "created_date": "2022-12-21T14:11:46.514Z", "modified_date": "2023-01-02T18:41:18.839Z"}}, {"model": "store.product", "pk": 10, "fields": {"product_name": "ROG Phone 6", "product_brand": "ROG Republic Of Gamers", "product_price": 1500, "product_description": "FOR THOSE WHO DARE.\r\n\r\nThe legend has evolved! The ROG Phone 6 is the latest incarnation of world-beating gaming phone. It harnesses the brute gaming power of the latest Qualcomm Snapdragon 8+ Gen 1 Mobile Platform, with a new class leading GameCool 6 thermal system that lets you smash every barrier and break every limit, and a 165 Hz display for a revolutionary visual experience. For total control, there’s the AirTrigger 6 system and the Armoury Crate app, and for marathon gameplay, there’s a monster 6000 mAh1 battery. Dare to choose the mighty ROG Phone 6, and you will be rewarded with an experience that befits a true legend.\r\n\r\n \r\n\r\nSTYLE, EVOLVED.\r\n\r\nCrafted with the spirit of adventure, the ROG Phone 6 reaches beyond its cyberpunk roots to explore the wider cosmos. With its fusion of geometric simplicity and cutting-edge technology, this next-gen gaming phone is your high-tech companion for your journey through space and time.\r\n\r\n \r\n\r\nPOWER, EVOLVED\r\n\r\nAre you ready for the invincible power of the Snapdragon 8+ Gen 1 Mobile Platform? Its unrivaled performance puts it in a class of its own, with the clock speed now boosted to a mind-blowing 3.2 GHz2 — with up to 15% better CPU performance2 and 20% more power efficiency2 over the previous Snapdragon 888 on the ROG Phone 5.\r\n\r\nOur world-famous Armoury Crate performance manager unlocks even more performance and tuning controls, giving the ROG Phone 6 complete mastery of this amazing CPU’s power to vanquish any task!", "product_specs": "Product Dimensions\t6.7 x 3 x 0.4 inches\r\nItem Weight\t12 ounces\r\nASIN\tB0BBS8C3MS\r\nItem model number\tAI2201\r\nBatteries\t1 Lithium Ion batteries required.\r\nCustomer Reviews\t3.8 out of 5 stars    5 ratings\r\n3.8 out of 5 stars\r\nOS\tAndroid 12.0\r\nRAM\t16 GB\r\nWireless communication technologies\tCellular\r\nConnectivity technologies\tUSB\r\nGPS\tTrue\r\nSpecial Features\tFast Charging Support\r\nOther display features\tWireless\r\nDevice interface - primary\tTouchscreen\r\nScanner Resolution\t8K\r\nOther camera features\tRear, Front\r\nForm Factor\tSmart Phone\r\nColour\tWhite\r\nBattery Power Rating\t6000 Milliampere Hour (mAh)\r\nIncluded Components\tUSB Cable\r\nManufacturer\tAsus\r\nDate First Available\tAugust 24, 2022", "product_image": "photos/products/6.jpg", "stock": 16, "is_available": true, "category": 1, "created_date": "2022-12-21T14:13:27.409Z", "modified_date": "2023-01-02T18:42:51.490Z"}}, {"model": "store.product", "pk": 11, "fields": {"product_name": "ThinkPad P16 (16” Intel) Mobile Workstation", "product_brand": "Lenovo", "product_price": 3000, "product_description": "OUR MOST POWERFUL MOBILE WORKSTATIONSFusing the portability of ThinkPad with the power of a workstation, P Series laptops feature ISV-certified applications, lightning-fast graphics & processing, and more cutting-edge technology to handle your compute-intensive needs - in a surprisingly thin, light package. Manufacturer: Lenovo Group Limited. Manufacturer Part Number: 21D6008WUS. Brand Name: Lenovo. Product Line: ThinkPad. Product Series: P16 G1. Product Model: 21D6008WUS. Product Name: ThinkPad P16 G1 21D6008WUS Mobile Workstation. Product Type: Mobile Workstation. [Processor] Processor Manufacturer: Intel. Processor Type: Core i9. Processor Generation: 12th Gen. Processor Model: i9-12950HX. Processor Core: Hexadeca-core (16 Core). Processor Speed: 2.30 GHz. Maximum Turbo Speed: 5 GHz. vPro Technology: Yes. [Memory] Total Installed System Memory: 32 GB. Maximum Supported System Memory: 128 GB. System Memory Technology: DDR5 SDRAM. System Memory Speed: 4800 MHz. [Display & Graphics] Screen Size: 16\". Display Screen Technology: In-plane Switching (IPS) Technology. Screen Mode: QHD. Screen Resolution: 2560 x 1600. Touchscreen: No. Graphics Controller Manufacturer: NVIDIA. Graphics Controller Model: RTX A2000. Graphics Memory Capacity: 8 GB. Graphics Memory Technology: GDDR6. Graphics Memory Accessibility: Dedicated. [Network & Communication] Wireless LAN: Yes. Wireless LAN Standard: IEEE 802.11ax. Ethernet Technology: Ethernet. Bluetooth: Yes. [Built-in Devices] Front Camera/Webcam: Yes. Infrared Camera: Yes. Finger Print Reader: Yes. [Interfaces/Ports] HDMI: Yes. Total Number of USB Ports: 5. Number of USB 3.2 Gen 1 Type-A Ports: 2. USB Type-C: Yes. USB Type-C Detail: 2 x Type-C (USB4.0, TBT4, DP1.4);1 x USB Typc-C (direct connect to dGPU for VR HMD). [Operating System] Operating System Platform: Windows. Operating System: Windows 11 Pro. Downgrada", "product_specs": "Standing screen display size\t‎16 Inches\r\nScreen Resolution\t‎2560 x 1600 pixels\r\nMax Screen Resolution\t‎2560 x 1600 Pixels\r\nProcessor\t‎2.3 GHz core_i9\r\nGraphics Coprocessor\t‎NVIDIA GeForce RTX A2000\r\nChipset Brand\t‎NVIDIA\r\nCard Description\t‎Dedicated\r\nWireless Type\t‎Bluetooth, 5 GHz Radio Frequency, Infrared, 802.11ax\r\nOther Technical Details\r\nBrand\t‎Lenovo\r\nItem model number\t‎21D6008WUS\r\nOperating System\t‎Windows 11 Pro\r\nItem Weight\t‎9.38 pounds\r\nPackage Dimensions\t‎19.25 x 13.25 x 4 inches\r\nProcessor Brand\t‎Intel\r\nFlash Memory Size\t‎128 GB", "product_image": "photos/products/1kv0210y0n1sdlx9ykg6ucaedhy6ez355356.webp", "stock": 25, "is_available": false, "category": 2, "created_date": "2022-12-21T14:15:16.244Z", "modified_date": "2023-01-02T18:43:13.225Z"}}, {"model": "store.product", "pk": 12, "fields": {"product_name": "Legion 5 Gen 7 AMD (15”) with RTX 3050 Ti", "product_brand": "Lenovo", "product_price": 700, "product_description": "The Lenovo Legion 5 is purpose-built for gaming performance. Experience today's top AAA games on this high-performance Lenovo gaming laptop. Inside the clean, minimalist chassis of the Legion 5 is everything you ever need to compete on equal footing with the pros. This includes the latest generation AMD Ryzen™ processor and NVIDIA® GeForce RTX™ 30 Series graphics for performance that’s AI-optimized by the Legion AI Engine powering the revolutionary Legion Coldfront 3.0 and Q Control. The 15\" FHD display will let you play your best with a combination of lightning-fast frame rates, 120 Hz refresh rate, and <3 ms response time, plus deep colors for full-fidelity gaming. Immerse yourself in the experience with Nahimic 3D Audio for Gamers, while the legendary Legion TrueStrike keyboard lets you make your move with pinpoint precision.\r\n\r\nThe Lenovo Legion 5 keeps you connected, with WiFi 6 and Bluetooth® 5.0 built in. And we've made sure that you have the ports you need, with 3 USB 3.2 Gen 1, a USB 3.2 Gen 1 (Always On), a USB-C 3.2 Gen 2 (supports data transfer and DisplayPort 1.4), a USB-C 3.2 Gen 2 (supports data transfer, Power Delivery, and DisplayPort 1.4), HDMI 2.1, Ethernet (RJ-45), and a 3.5mm Headphone / microphone combo jack. And there's an E-Shutter webcam kill switch to help protect your privacy.", "product_specs": "Standing screen display size\t‎15.6\r\nMax Screen Resolution\t‎1920 x 1080 Pixels\r\nProcessor\t‎3.3 ryzen_5\r\nRAM\t‎8 GB DDR4\r\nHard Drive\t‎512 GB SSD\r\nGraphics Coprocessor\t‎NVIDIA GeForce RTX 3050\r\nChipset Brand\t‎NVIDIA\r\nCard Description\t‎Dedicated\r\nGraphics Card Ram Size\t‎4 GB\r\nWireless Type\t‎802.11ax\r\nNumber of USB 3.0 Ports\t‎6\r\nOther Technical Details\r\nBrand\t‎Lenovo\r\nSeries\t‎Lenovo Legion 5 15\"\r\nItem model number\t‎82JW00BHUS\r\nOperating System\t‎Windows 11 Home\r\nItem Weight\t‎8.6 pounds\r\nProduct Dimensions\t‎14.27 x 10.26 x 0.89 inches\r\nItem Dimensions LxWxH\t‎14.27 x 10.26 x 0.89 inches\r\nColor\t‎Phantom Blue\r\nProcessor Brand\t‎AMD\r\nProcessor Count\t‎1\r\nComputer Memory Type\t‎DDR4 SDRAM\r\nPower Source\t‎Battery Powered\r\nBatteries\t‎1 Lithium Polymer batteries required. (included)", "product_image": "photos/products/2.jpg", "stock": 33, "is_available": true, "category": 2, "created_date": "2022-12-21T14:17:18.220Z", "modified_date": "2023-01-02T18:43:24.766Z"}}]